src/test/resources/biz/turnonline/ecosystem/payment/subscription/transaction-created-card_payment.json

{
    "event": "TransactionCreated",
    "timestamp": "2020-03-06T09:11:37.925965Z",
    "data": {
        "id": "0dfaec58-6043-11ea-bc55-0242ac130003",
        "type": "card_payment",
        "state": "pending",
        "request_id": "GPS:00000000-0000-0000-0000-000564lljr78",
        "created_at": "2020-03-06T09:11:37.960098Z",
        "updated_at": "2020-03-06T09:11:37.960098Z",
        "merchant": {
            "name": "Best, Ltd.",
            "city": "Bratislava",
            "category_code": "7523",
            "country": "SVK"
        },
        "legs": [
            {
                "leg_id": "e1af97b8-18a7-4c67-8b84-6d287dee1c3b",
                "account_id": "48ff3db4-1a8c-4b0c-ac90-f79f333a333e",
                "amount": -2,
                "currency": "EUR",
                "description": "Best, Ltd."
            }
        ],
        "revertable": true,
        "card": {
            "card_number": "442581******7123",
            "first_name": "John",
            "last_name": "Foo",
            "phone": "+421905905905"
        }
    }
}